### Query Results Notebook
This notebook provides an abridged view of the results from the proposed solutions for each query prompt in a SQL mini-project assignment. Here, a database has been created with tables based on ingested flat files that pertain to data about a soccer tournament. Each question and results are provided below. The queries generating each result are available for view in the <tt>src</tt> directory.

In [10]:
# Packages and environment variables
import os
import pandas as pd
from sqlalchemy import create_engine
from dotenv import load_dotenv, dotenv_values
from IPython.display import display
import re

# Constants
load_dotenv("../src/.env")
DB_USER = os.getenv("DB_USER")
DB_PASSWORD = os.getenv("DB_PASSWORD")
HOST = os.getenv("HOST")
PORT = os.getenv("PORT")
DB_NAME = "euro_cup_2016"
INIT_CONNECT_STR = f"mysql+mysqlconnector://{DB_USER}:{DB_PASSWORD}@{HOST}:{PORT}"
DB_CONNECT_STR = INIT_CONNECT_STR+f"/{DB_NAME}"
QUERY_FILES = [i for i in os.listdir("../src") if bool(re.match("sql_",i))]

# Engine
engine = create_engine(DB_CONNECT_STR)

In [11]:
for file in QUERY_FILES:
    with open(f"../src/{file}") as f:
        query = f.read()
        question = re.sub("-- ", "", query.split("\n")[0])
        print(question)
        display(pd.read_sql(query, engine).head(5))
        print('')

1. Write a SQL query to find the date EURO Cup 2016 started on.

   start_date
0  2016-06-11

2. Write a SQL query to find the number of matches that were won by penalty shootout.

   win_count
0          3

3. Write a SQL query to find the match number, date, and score for matches in which no stoppage time was added in the 1st half.

   match_no   play_date goal_score
0         4  2016-06-12        1-1

4. Write a SQL query to compute a list showing the number of substitutions that happened in various stages of play for the entire tournament.

   subs
0   293

5. Write a SQL query to find the number of bookings that happened in stoppage time.

   bookings
0        10

6. Write a SQL query to find the number of matches that were won by a single point, but do not include matches decided by penalty shootout.

   matches_won_by_one
0                  21

7. Write a SQL query to find all the venues where matches with penalty shootouts were played.

   venue_id               venue_name
0     20009  Stade Geoffroy Guichard
1     20005          Stade VElodrome
2     20001        Stade de Bordeaux

8. Write a SQL query to find the match number for the game with the highest number of penalty shots, and which countries played that match.

   match_no  team_id country_name
0        47     1208      Germany
1        47     1211        Italy

9. Write a SQL query to find the goalkeeper’s name and jersey number, playing for Germany, who played in Germany’s group stage matches.

   player_gk   player_name  jersey_no country_name play_stage
0     160163  Manuel Neuer          1      Germany          G

10. Write a SQL query to find all available information about the players under contract to Liverpool F.C. playing for England in EURO Cup 2016.

,player_id,team_id,jersey_no,player_name,posi_to_play,dt_of_bir,age,playing_club
0,160121,1206,12,Nathaniel Clyne,DF,1991-04-05,25,Liverpool
1,160129,1206,14,Jordan Henderson,MF,1990-06-17,26,Liverpool
2,160130,1206,8,Adam Lallana,MF,1988-05-10,28,Liverpool
3,160131,1206,4,James Milner,MF,1986-01-04,30,Liverpool
4,160137,1206,15,Daniel Sturridge,FD,1989-09-01,26,Liverpool

11. Write a SQL query to find the players, their jersey number, and playing club who were the goalkeepers for England in EURO Cup 2016.

   player_id     player_name  jersey_no playing_club
0     160116  Fraser Forster         13  Southampton
1     160117        Joe Hart          1    Man. City
2     160118      Tom Heaton         23      Burnley

12. Write a SQL query that returns the total number of goals scored by each position on each country’s team. Do not include positions which scored no goals.

  country_name posi_to_play  goals_scored
0      Albania           FD             1
1      Austria           MF             1
2      Belgium           DF             1
3      Belgium           FD             3
4      Belgium           MF             5

13. Write a SQL query to find all the defenders who scored a goal for their teams.

   player_id        player_name
0     160470       Fabian Schar
1     160373  Vasili Berezutski
2     160423       Gerard Pique
3     160327       Ciaran Clark
4     160262     Gareth McAuley

14. Write a SQL query to find referees and the number of bookings they made for the entire tournament. Sort your answer by the number of bookings in descending order.

   referee_id      referee_name  num_bookings
0       70005  Mark Clattenburg            21
1       70011    Nicola Rizzoli            20
2       70010     Milorad Mazic            13
3       70007     Viktor Kassai            12
4       70001     Damir Skomina            12

15. Write a SQL query to find the referees who booked the most number of players.

   referee_id      referee_name
0       70005  Mark Clattenburg

16. Write a SQL query to find referees and the number of matches they worked in each venue.

    referee_name               venue_name  match_count
0  Damir Skomina      Stadium de Toulouse          0.0
1  Damir Skomina  Stade Geoffroy Guichard          0.0
2  Damir Skomina          Stade de France          0.0
3  Damir Skomina         Parc des Princes          0.0
4  Damir Skomina            Stade de Nice          1.0

17. Write a SQL query to find the country where the most assistant referees come from, and the count of the assistant referees.

  country_name  num_asst_refs
0      England              4

18. Write a SQL query to find the highest number of foul cards given in one match.

   highest_foul_count
0                  10

19. Write a SQL query to find the number of captains who were also goalkeepers.

   num_captain_gk
0               4

20. Write a SQL query to find the substitute players who came into the field in the first half of play, within a normal play schedule.

   player_id             player_name
0     160444          Erik Johansson
1     160180  Bastian Schweinsteiger
2     160321        Ricardo Quaresma

In [12]:
# Cleanup
engine.dispose()